{
  "backend/main.mo": "Actor implements researcher profile, interests, publications, contact info, and user profile management with access control and blob storage integration.",
  "feature_evidence.json": "Defines feature evidence reports listing implemented features, affected files, components, and related requirements.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of all frontend source files for reference or tooling.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component setting up React Query, theme provider, and rendering the HomePage with a toaster.",
  "frontend/src/components/admin/AdminEditPanel.tsx": "Provides a side panel with tabbed admin forms for editing profile, interests, publications, and contact info.",
  "frontend/src/components/admin/ContactInfoEditForm.tsx": "Form for editing and saving email and affiliation with query/mutation hooks.",
  "frontend/src/components/admin/ProfileEditForm.tsx": "Admin form to edit name, biography, and profile photo with upload and removal support.",
  "frontend/src/components/admin/PublicationsEditor.tsx": "UI for adding new publications including title, description, optional link, and optional PDF upload.",
  "frontend/src/components/admin/ResearchInterestsEditor.tsx": "Allows adding and deleting research interests, showing current interests with confirmation dialogs for removal.",
  "frontend/src/components/ContactSection.tsx": "Displays contact email and affiliation with loading skeletons and styled cards.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation, theme toggle, login, and owner-only edit panel access.",
  "frontend/src/components/HeroSection.tsx": "Hero section rendering profile photo, name, and biography with skeleton and fallback UI.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity hooks and handles auth state transitions.",
  "frontend/src/components/PublicationsSection.tsx": "Displays a publications list with loading, empty, and populated states, rendering links or PDFs when available.",
  "frontend/src/components/ResearchInterestsSection.tsx": "Shows research interests as badges with a loading skeleton and hides the section if none exist.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing identity loading, login, and logout through a React context.",
  "frontend/src/hooks/useMutations.ts": "Defines mutation hooks for profile, research interests, and publications, invalidating queries and showing toast notifications.",
  "frontend/src/hooks/useOwnerStatus.ts": "Queries whether the authenticated user is the owner and provides combined loading and auth status.",
  "frontend/src/hooks/useQueries.ts": "Provides query hooks to fetch profile data, interests, publications, contact info, and the caller’s user profile using the actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and theming variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/HomePage.tsx": "Fetches profile-related data and renders the main homepage sections including hero, interests, publications, and contact info.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters, including session persistence and hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including feature implementations, pending requests, and overall state for editable profile and access control features."
}