{
  "backend/main.mo": "Motoko canister managing researcher profile data, user profiles, access control, and CRUD operations with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping new user‑profile and UI functionality to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of all frontend components and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH‑based light/dark theme variables and global styles.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level React component configuring QueryClientProvider and ThemeProvider and rendering HomePage.",
  "frontend/src/components/admin/AdminEditPanel.tsx": "Side panel for editing profile, interests, publications, and contact info using tabbed navigation.",
  "frontend/src/components/admin/ContactInfoEditForm.tsx": "Form for editing email and affiliation, prefilled from query data and saved via mutation.",
  "frontend/src/components/admin/ProfileEditForm.tsx": "Form to edit name, biography, and profile photo with preview, removal option, and blob upload handling.",
  "frontend/src/components/admin/PublicationsEditor.tsx": "Editor for adding new publications with title, description, link, and optional PDF upload using mutations.",
  "frontend/src/components/admin/ResearchInterestsEditor.tsx": "Component for adding and deleting research interests using query hooks and confirmation dialogs.",
  "frontend/src/components/ContactSection.tsx": "UI section displaying email and affiliation with loading skeletons and conditional rendering.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and themed heart icon.",
  "frontend/src/components/Header.tsx": "Header with navigation, theme toggle, login, owner edit button, and personal info sheet access for non‑owners.",
  "frontend/src/components/HeroSection.tsx": "Displays a hero section showing a loading skeleton, a message when no profile exists, or the user's profile with photo and biography.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading state handling and error recovery.",
  "frontend/src/components/PublicationsSection.tsx": "Renders a publications list with loading skeletons, empty-state messaging, and cards linking to papers or PDFs.",
  "frontend/src/components/ResearchInterestsSection.tsx": "Shows research interests as badges with loading skeletons and hides the section when no data exists.",
  "frontend/src/components/user/PersonalInfoEditorSheet.tsx": "Sheet UI for editing and saving the caller user's personal info with form state and save mutation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and exposing identity state.",
  "frontend/src/hooks/useMutations.ts": "Collection of mutation hooks for profile, research interests, and publications, each calling actor methods and invalidating queries.",
  "frontend/src/hooks/useOwnerStatus.ts": "Hook that checks whether the authenticated user is the owner by querying the actor.",
  "frontend/src/hooks/useQueries.ts": "Query hooks for fetching profile data, research interests, publications, contact info, and caller user profile.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and applying global styles.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Home page fetching profile, interests, publications, and contact data, then rendering corresponding sections with loading states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state file describing schema versions, existing features, new feature requests, and metadata for the user profile update project."
}