{
  "kind": "build_request",
  "title": "Add UI to update logged-in user's personal info (UserProfile)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a logged-in user experience that allows an authenticated (non-owner) user to view and update their own personal information stored as the backend UserProfile (currently: name) by calling getCallerUserProfile and saveCallerUserProfile.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "update personal info"
        ]
      },
      "acceptanceCriteria": [
        "When a user is authenticated, they can open a Personal Info UI and see their current saved name (or an empty value if none exists yet).",
        "Submitting the form calls the backend saveCallerUserProfile with the updated name and shows a success toast on completion.",
        "After saving, subsequent reads (and any UI displaying the current user profile) reflect the updated name without a full page refresh.",
        "If the backend rejects the call with an authorization error, the UI shows a clear error toast/message and does not crash."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement React Query hooks to fetch and mutate the caller's UserProfile, including cache invalidation for the existing query key used for the current user profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "update personal info"
        ]
      },
      "acceptanceCriteria": [
        "A mutation hook exists that calls saveCallerUserProfile and invalidates the ['currentUserProfile'] query on success.",
        "Errors from the mutation are surfaced to the user via the existing toast system (sonner)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Expose entry points in the existing UI to access the Personal Info editor for authenticated users who are not the portfolio owner, without granting access to the owner-only Admin Edit panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "update personal info"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as a non-owner, the user has a visible way to open the Personal Info editor (e.g., from the header near the login button).",
        "When logged out, the Personal Info editor entry point is hidden or disabled.",
        "The existing owner-only Edit panel behavior remains unchanged (only owners see the Edit button and can open AdminEditPanel)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose shadcn components instead).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo; only add migration if state schema changes are required."
  ],
  "nonGoals": [
    "Do not change the researcher portfolio owner-editable fields (profile, interests, publications, contact info) or their access control behavior.",
    "Do not add third-party authentication (Internet Identity only).",
    "Do not add additional personal info fields beyond what the backend UserProfile currently supports (name) unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}