{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Personal Info editor for authenticated non-owner users (UserProfile name)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an authenticated, non-owner UI to view and update the caller’s UserProfile name via existing backend functions, with success/error feedback and live UI refresh.",
      "acceptanceCriteria": [
        "When a user is authenticated, they can open a Personal Info UI and see their current saved name (or an empty value if none exists yet).",
        "Submitting the form calls the backend saveCallerUserProfile with the updated name and shows a success toast on completion.",
        "After saving, subsequent reads (and any UI displaying the current user profile) reflect the updated name without a full page refresh.",
        "If the backend rejects the call with an authorization error, the UI shows a clear error toast/message and does not crash."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/user/PersonalInfoEditorSheet.tsx",
          "operation": "create",
          "description": "Create a Personal Info editor UI (use shadcn-ui composed components such as Sheet/Drawer, Input, Label, and Button) that reads the caller profile via useGetCallerUserProfile, allows editing only the UserProfile.name field, and saves via a dedicated mutation hook with sonner toasts for success/error. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Wire the PersonalInfoEditorSheet into the existing header: for authenticated non-owner users, show a visible entry point button to open the editor; optionally display the current UserProfile name in the header area when available, and ensure it updates automatically after save via React Query cache updates (no full refresh)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add React Query mutation hook for saveCallerUserProfile with invalidation of the existing ['currentUserProfile'] cache key and toast-based error surfacing.",
      "acceptanceCriteria": [
        "A mutation hook exists that calls saveCallerUserProfile and invalidates the ['currentUserProfile'] query on success.",
        "Errors from the mutation are surfaced to the user via the existing toast system (sonner)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMutations.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook (e.g., useSaveCallerUserProfile) that calls actor.saveCallerUserProfile({ name }), shows a success toast on completion, and invalidates the ['currentUserProfile'] query key; on error, surface the message via sonner (including clear messaging for authorization failures)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Confirm/align the caller UserProfile query hook to use the existing query key ['currentUserProfile'] and correct actor dependency gating (enabled only when the actor is ready), so invalidation triggers immediate refetch without UI flash."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Expose a non-owner authenticated entry point to Personal Info editing while keeping the owner-only Admin Edit panel access unchanged.",
      "acceptanceCriteria": [
        "When logged in as a non-owner, the user has a visible way to open the Personal Info editor (e.g., from the header near the login button).",
        "When logged out, the Personal Info editor entry point is hidden or disabled.",
        "The existing owner-only Edit panel behavior remains unchanged (only owners see the Edit button and can open AdminEditPanel)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update conditional rendering in the header to: (1) keep the existing owner-only Admin Edit button exactly as-is, (2) add a separate Personal Info editor entry point visible only when authenticated AND not owner, and (3) hide/disable that entry point when logged out."
        },
        {
          "path": "frontend/src/components/user/PersonalInfoEditorSheet.tsx",
          "operation": "modify",
          "description": "Ensure the editor component supports being mounted from the header with controlled open/close state and behaves correctly when the user is unauthenticated (no crashes; UI should not be reachable via header when logged out). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}